"""Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).

В классе должны быть реализованы методы перегрузки арифметических операторов:
сложение (__add__()), вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).

Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и обычное
(не целочисленное) деление клеток, соответственно.

В методе деления должно осуществляться округление значения до целого числа.

Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше
нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих
двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду. Данный метод
позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
*****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
*****\n*****\n*****.
"""


class Cell:
    cell_num = 0

    def __init__(self, cell_units: int):
        self.cell_units = cell_units
        Cell.cell_num += 1

    def __add__(self, other):
        Cell.cell_num -= 1
        return self.cell_units + other.cell_units

    def __sub__(self, other):
        if self.cell_units > other.cell_units:
            return self.cell_units - other.cell_units
        else:
            return 'Невозможно произвести вычитание. Исходная клетка слишком мала...'

    def __mul__(self, other):
        Cell.cell_num -= 1
        return self.cell_units * other.cell_units

    def __truediv__(self, other):
        Cell.cell_num -= 1
        return self.cell_units // other.cell_units

    def make_order(self, n):
        temp_list = list(self.cell_units * '*')
        idx = 0
        while self.cell_units > n:
            idx += n
            self.cell_units = self.cell_units - n
            temp_list.insert(idx, '\n')
            idx += 1
        return f'{"".join(temp_list)}'


cell_1 = Cell(12)
cell_2 = Cell(15)
cell_3 = Cell(21)
cell_4 = Cell(60)
cell_5 = Cell(33)
cell_6 = Cell(60)
cell_7 = Cell(11)
cell_8 = Cell(22)
print(Cell.cell_num)

print(cell_1 + cell_2, Cell.cell_num)
print(cell_3 - cell_4, Cell.cell_num)
print(cell_5 * cell_6, Cell.cell_num)
print(cell_6 / cell_8, Cell.cell_num)

print(cell_1.make_order(4))
print(cell_8.make_order(5))
